---
kind: property
id: P:Autodesk.Revit.DB.Structure.AreaReinforcementCurve.Curve
zh: 曲线
source: html/301bf966-bbf1-62b2-fed5-6703e55aeb57.htm
---
# Autodesk.Revit.DB.Structure.AreaReinforcementCurve.Curve Property

**中文**: 曲线

Returns the 3D curve forming part of the boundary of an Area Reinforcement element.

## Syntax (C#)
```csharp
public Curve Curve { get; }
```